Documents/НастройкиКонтроляПрайсЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НастройкиКонтроляПрайсЛистов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоВидамНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПоНоменклатуре</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НастройкиКонтроляПрайсЛистов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Проверки при проведении
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		// Проверка на задвоение по ключам "ВидНоменклатуры, Категория, ВидЦены"
		ВремТаблица = Объект.НастройкиПоВидамНоменклатуры.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("ВидНоменклатуры, Категория, ВидЦены", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("Задвоены записи по ключам: %1%2%3 вид цены ""%4"".",
					?(ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры), "вид номенклатуры """ + ТекущаяСтрока.ВидНоменклатуры + """,", ""),
					?(ЗначениеЗаполнено(ТекущаяСтрока.ВидНоменклатуры) И ЗначениеЗаполнено(ТекущаяСтрока.Категория), ", ", ""),
					?(ЗначениеЗаполнено(ТекущаяСтрока.Категория), "категория """ + ТекущаяСтрока.Категория + """,", ""),
					ТекущаяСтрока.ВидЦены
				));
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Проверка на задвоение по ключам "Номенклатура, ВидЦены"
		ВремТаблица = Объект.НастройкиПоНоменклатуре.Выгрузить();
		
		ВремТаблица.Колонки.Добавить("Количество");
		ВремТаблица.ЗаполнитьЗначения(1, "Количество");
		
		ВремТаблица.Свернуть("Номенклатура, ВидЦены", "Количество");
		
		Для Каждого ТекущаяСтрока Из ВремТаблица Цикл
			
			Если ТекущаяСтрока.Количество > 1 Тогда
				
				Сообщить(СтрШаблон("Задвоены записи по ключам: %1 вид цены ""%2"".",
					ТекущаяСтрока.Номенклатура,
					ТекущаяСтрока.ВидЦены
				));
				
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
